<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <!-- Install the certificate -->
        <dict>
            <key>PayloadCertificateFileName</key>
            <string>identity.getpostman.com.crt</string>
            <key>PayloadContent</key>
            <data>
MIIDojCCAoqgAwIBAgIUWxP2QYR/93UbOTzQdBiMaxKwzA0wDQYJKoZIhvcNAQELBQAwUzELMAkGA1UEBhMCVVMxIjAgBgNVBAoMGVBvc3Rkb3QgVGVjaG5vbG9naWVzLCBJbmMxIDAeBgNVBAMMF2lkZW50aXR5LmdldHBvc3RtYW4uY29tMB4XDTI1MDgyNzEyNTg1N1oXDTM1MDgyNTEyNTg1N1owUzELMAkGA1UEBhMCVVMxIjAgBgNVBAoMGVBvc3Rkb3QgVGVjaG5vbG9naWVzLCBJbmMxIDAeBgNVBAMMF2lkZW50aXR5LmdldHBvc3RtYW4uY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAn0wM+4uOb7xdBD+2n4VKA4xXME8TzWzyyzMysLbiooRYpn+n7bduM85ARJYs2ue5APZhrTb1zBRDTvQ1izmA8gg4WkWPhqz+e88Ityt+txoT7XcMJtWt6lx9BGOEH+hSpOeN+zb/MseQDDkUVGDrv+ouU4QNdF1mNNzZjsSDL67W0TeMR93mzQ0Rj7zJRE3SNbakbcXZZroSn9RaYmFILJ5k6sl3BLBVrYZkAwOu9JxeSFTLA5XJePy6xLGAQld1ouCmtmDfnBREcUNduI/lZ4DtD0pF5leGaPuvA8rteynRB13wxjFvaa2aJGg2IQHIaYdhzMzv5lfAI2KXvZ9FVQIDAQABo24wbDAJBgNVHRMEAjAAMAsGA1UdDwQEAwIE8DAzBgNVHREELDAqghdpZGVudGl0eS5nZXRwb3N0bWFuLmNvbYIJbG9jYWxob3N0hwR/AAABMB0GA1UdDgQWBBQvR7vROyORUqlM4oaKnNKwDgZ8OTANBgkqhkiG9w0BAQsFAAOCAQEAK6aPtDp+yc/4W7ThsGxMmLl761NnBZx0gjFBXgedlx6YHSOr0STGUZsN6SttWgGHmM/KDKrK6Av4NFFsIhT29SIJwI4jydnzF6AUIKO7CGckjrM7Eu6ldLZhhFQ84KHNTGlaqgbJmunt+istNegeb6ByGzS08PvSNpd8AHnx2pYzq58K3/Y5nOy9ufEoKDD5RXdfgm9XGPl5pb+PbEJd5eK0pRQ6BAa1LEE4sLQrJ6mJwoNToAZDMOlmJWuc3V1Q9lX62YSRVSvN6C0TqDonbSy9JbYl/m0jAn0LWuPt2tgqhPzkvbl4MJOW2RIRBk59I+3q0eyiVDoaCzWcFpr31w==
            </data>
            <key>PayloadDescription</key>
            <string>Installs the Postman AuthRouter SSL certificate for SAML enforcement</string>
            <key>PayloadDisplayName</key>
            <string>Postman AuthRouter Certificate</string>
            <key>PayloadIdentifier</key>
            <string>com.postman.authrouter.certificate.4CA083DD-7C20-4639-B2AE-69CED34229CB</string>
            <key>PayloadType</key>
            <string>com.apple.security.root</string>
            <key>PayloadUUID</key>
            <string>4CA083DD-7C20-4639-B2AE-69CED34229CB</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>AllowAllAppsAccess</key>
            <true/>
        </dict>
        <!-- Configure trust settings for the certificate -->
        <dict>
            <key>PayloadType</key>
            <string>com.apple.security.certificatetrust</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadIdentifier</key>
            <string>com.postman.authrouter.trust.37E0EC80-B8C1-400F-9E26-4254592419EA</string>
            <key>PayloadUUID</key>
            <string>AAE6D71F-9022-4113-9206-8B39C9380B11</string>
            <key>PayloadDisplayName</key>
            <string>Certificate Trust Settings</string>
            <key>PayloadDescription</key>
            <string>Trust settings for Postman AuthRouter certificate</string>
            <key>PayloadOrganization</key>
            <string>Postman</string>
            <key>TrustedCertificates</key>
            <array>
                <dict>
                    <key>SHA1Fingerprint</key>
                    <data>7PLel7NniUi1dDSqf+n8C4wTrbE=</data>
                    <key>TrustSettings</key>
                    <dict>
                        <key>kSecTrustSettingsAllowedError</key>
                        <integer>-2147408896</integer>
                        <key>kSecTrustSettingsResult</key>
                        <integer>1</integer>
                    </dict>
                </dict>
            </array>
        </dict>
    </array>
    <key>PayloadDescription</key>
    <string>This profile installs the Postman AuthRouter SSL certificate as a trusted root certificate to enable SAML enforcement for identity.getpostman.com. This is required for the Postman Enterprise SAML integration to function properly.</string>
    <key>PayloadDisplayName</key>
    <string>Postman Enterprise AuthRouter Certificate Trust</string>
    <key>PayloadIdentifier</key>
    <string>com.postman.authrouter.certificate</string>
    <key>PayloadOrganization</key>
    <string>Postman</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>171FF398-F28D-493D-9D7D-F54D6F785C71</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
